=================
All Commands
=================

\*absolute \*
----------------
Description: Takes in the numbers, and outputs the absolute numbers.

Input: Numbers

Arguments: NONE

Example(s):
``*absolute -1 2 -3 -5 50 *``

Returns:
``1 2 3 5 50``

\*acos \*
----------------
Description: Takes in the a decimal, and finds the inverse of cosine.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*acos .5 *``

Returns:
``1.0471975511965979``

\*acosh \*
----------------
Description: Takes in the a decimal, and finds the inverse of hyperbolic cosine function.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*acosh *pi* *``

Returns:
``1.8115262724608532``

\*acotanh \*
----------------
Description:Takes in the a decimal, and finds the inverse of hyperbolic cotangent function.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*acotanh *pi* *``

Returns:
``0.3297653149566992``

\*acsch \*
----------------
Description:Takes in the a decimal, and finds the inverse of hyperbolic cosecant function.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*acsch 1 *``

Returns:
``0.8813735870195429``

\*add \* or \*+ \*
---------------------
Description:Takes in numbers and adds them all together.

Input: Number or Numbers

Arguments: NONE

Example(s):
``*add 3 2 *``
``*+ 5 2 6 8 *``

Returns:
``5``
``21``

\*alternatecase \*
--------------------
Description:Takes in a string, and switches uppercase letters to lowercase letters and vice versa.

Input: String

Arguments: NONE

Example(s):
``*alternatecase Hello 22 worlD HoW ArE U today *``

Returns:
``hELLO 22 WORLd hOw aRe u TODAY``

\*and \*
-------------------
Description: Takes in values, if all values evaluate to true returns true, if one of the values evaluate to false returns false.

Input: Booleans or Strings or Numbers

Arguments: NONE

Example(s):
``*and true 1 55 *``
``*and true 0 55 *``
``*and true 55 false *``

Returns:
``true``
``false``
``false``

\*aperys \*
-------------------
Description: Returns Apery's constant.

Input: NONE

Arguments: NONE

Example(s):
``*aperys *``

Returns:
``1.2020569``

\*arccos \*
----------------
Alias: acos
Description: Takes in the a decimal, and finds the inverse of cosine.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*arccos .5 *``

Returns:
``1.0471975511965979``

\*arccosecant \*
------------------
Alias: arccsc
Description: Takes in the a decimal, and finds the inverse of cosecant.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*arccosecant 1 *``

Returns:
``1.5707963267948966``

\*arccot \*
----------------

Alias: arccotangent
Description: Takes in the a decimal, and finds the inverse of cotangent.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*arccot 1 *``

Returns:
``0.7853981633974483``

\*arccotangent \*
-------------------
Alias: arccot
Description: Takes in the a decimal, and finds the inverse of cotangent.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*arccotangent 1 *``

Returns:
``0.7853981633974483``

\*arccsc \*
----------------
Alias: arccosecant
Description: Takes in the a decimal, and finds the inverse of cosecant.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*arccsc 1 *``

Returns:
``1.5707963267948966``

\*arcsec \*
----------------
Alias: arcsecant
Description: Takes in the a decimal, and finds the inverse of secant.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*arcsec 2 *``

Returns:
``1.0471975511965979``

\*arcsecant \*
----------------
Alias: arcsec
Description: Takes in the a decimal, and finds the inverse of secant.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*arcsecant 2 *``

Returns:
``1.0471975511965979``

\*arcsin \*
----------------
Alias: asin
Description: Takes in the a decimal, and finds the inverse of sine.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*arcsin 1 *``

Returns:
``1.5707963267948966``

\*arctangent \*
-----------------
Alias: atan
Description: Takes in the a decimal, and finds the inverse of tangent.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*arctangent 1 *``

Returns:
``0.7853981633974483``

\*asech \*
-----------------
Description:Takes in the a decimal, and finds the inverse of hyperbolic secant function.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*asech .5 *``

Returns:
``1.3169578969248166``

\*asin \*
----------------
Description:Takes in the a decimal, and finds the inverse of sine function.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*asin 1 *``

Returns:
``1.5707963267948966``

\*asinh \*
----------------
Description:Takes in the a decimal, and finds the inverse of hyperbolic sine function.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*asinh 1 *``

Returns:
``0.8813735870195429``

\*ask \*
----------------
Description: Asks user a question, the answer gets returned!

Input: A question to ask.

Arguments: String (Optional: Default answer [default: none])

Example(s):
``*ask=yes Do you like Ice Cream? *``

Returns:
user response to the question.

\*atan \*
----------------
Description:Takes in the a decimal, and finds the inverse of tangent function.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*atan 1 *``

Returns:
``0.7853981633974483``

\*atanh \*
----------------
Description:Takes in the a decimal, and finds the inverse of hyperbolic tangent function.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*atanh .5*``

Returns:
``0.5493061443340549``

\*author \*
----------------
Description: Takes in a string, and creates an "author" heading with it.

Input: A String to be used to create "author" heading.

Arguments: NONE

Example(s):
``*author AndreiM *``

Returns:
A new string with "author" heading.

\*backbutton \*
----------------
Description: Creates a button that allows you to go back in browser.

Input: String (Optional: Button Name [default: Go Back])

Arguments: NONE

Example(s):
``*backbutton I need to go Back *``

Returns:
Creates a button with a "I need to go Back" label.

\*background \*
-----------------
Description: Sets the background of the input content.

Input: Content

Arguments: String[Color Name] or Hex Value or rgb() or URL[for images] (Optional: Background Color/Image[default: red]), String (Optional: sets second color for gradient[default:none])

Example(s):
``*background=yellow,blue I am awesome *``

Returns:
Sets background of "I am awesome" content to yellow/blue mix.

\*backgroundcolor \*
---------------------
Description: Takes the text and sets the background of the text.

Input: Text to what the background color will be applied to.

Arguments: String[Color Name] or Hex Value or rgb() format value  (Optional: Color of Text[default: #428bca (skyblue)])

Example(s):
``*backgroundcolor=red hello *``

Returns:
hello with red highlighted color

\*banner \*
----------------
Description: Creates an image banner (usually used to display a logo on site or on a forum) by taking in image and optional width and height arguments.
Compare with \*picture \*

Input: Image Source

Arguments: Size or "%" or Number  (Optional: Width of Banner[default: 100%]), Size or "%" or Number (Optional: Height of Banner[default: 200px])

Example(s):
``*banner  *``

Returns:
Returns a banner

.. note: width cannot be greater than 100%.

\*blink \*
----------------
Description: Makes the content blink(fade in and out) every so many seconds.

Input: Text of the content to be blinked

Arguments: Number (Optional: Every how many seconds to blink[default: 2]), Number (Optional: How many steps to take each blink)

Example(s):
``*blink=2,4 Hello *``

Returns:
Blinks text Hello every 2 seconds taking 4 steps...

\*block \*
----------------
Description: Takes in the content, and puts the text inside a block(box)

Input: Content of what to put into the block

Arguments: number (Optional: width of the block)

Example(s):
``*block=500px hello *``

Return:
Block content

\*blur \*
----------------
Description: Blurs the content

Input: Text to be blurred

Arguments: String[colorname] (Optional: Color to use to blur[default: black])

Example(s):
``*blur=red Hello *``

Returns:
Blurs hello with the color red.

\*bold \*
----------------
Description: Makes text bold

Input: Text to be blurred

Arguments: NONE

Example(s):
``*bold Hello *``

Returns:
Makes Hello bold.

\*border \*
----------------
Description: Creates a border around content

Input: Content to be bordered

Arguments: String[colorname] (Optional: Color of border[default: black]), Number(Optional: Thickness of border[default: 1], String[style] (Optional: Style of the line[default:solid])

Example(s):
``*border hellow *``

Returns:
Creates a border/box around "hellow".

\*bullet \*
----------------
Description: Creates bulleted content

Input: Content to be bulleted

Arguments: NONE

Example(s):
``*bullet hello *``

Returns:
Creates a bullet with "hello". 

.. note: You may use multiple bullets by executing same command.

\*button \*
----------------
Description: Creates a button

Input: The URL the button should redirect (default: #[none])

Arguments: String (Optional: Name of the button [default:Submit]), String[color] (Optional: Color of button [default:SteelBlue])

Example(s):
``*button http://juliar.org *``

Returns:
Creates a button that redirects to http://juliar.org

\*capitalize \*
-----------------
Description: Capitalizes the first letter of each word

Input: String in which each word will be capitalized

Arguments: NONE

Example(s):
``*capitalize There once was a dragon That lived on a shore *``

Returns:
``There Once Was A Dragon That Lived On A Shore``

\*center \*
----------------
Description: Centers the text

Input: The text to be centered.

Arguments: NONE

Example(s):
``*center I am centered *``

Returns:
Centers the text "I am centered"

\*chapter \*
----------------
Description: Creates a pretty first letter like in books.

Input: The text in which first letter will be big.

Arguments: NONE

Example(s):
``*chapter There once was a bug *``

Returns:
The "T" will be big and "here once was a bug" will be small.

\*checkrepo \*
----------------
Description: Check if repo is working

Input: The repo URL

Arguments: NONE

Example(s):
``*repo http://repo.juliar.org *``

Returns:
Whether or not the repo seems to be working. If working, it will return that repo has a pulse, if not it will return that repo is not active.


\*checkrepo \*
----------------
Description: Check if repo is working

Input: The repo URL

Arguments: NONE

Example(s):
``*repo http://repo.juliar.org *``

Returns:
Whether or not the repo seems to be working. If working, it will return that repo has a pulse, if not it will return that repo is not active.

\*cityfromip \*
-----------------
Description: Tries to find the city of where ip is originated

Input: String[ip]

Arguments: NONE

Example(s):
``*cityfromip 8.8.8.8 *``

Returns:
This is one of google's ips and outputs "Mountain View"

\*code \*
----------------
Description: Allows use of <, >, & without them being treated as HTML

Input: content that may contains those values and may be treated as HTML.

Arguments: NONE

Example(s):
``*code <hello> *``

Returns:
``<hello>``

.. note: without this command <hello> will be treated as HTML tag.

\*color \*
----------------
Description: Sets color of text, each word can be set to a different color by passing in more colors as arguments

Input: String

Arguments: String(Optional: Colors to color each word. If one color is set, it will color everything in one color, else it will alternate each color) x Infinity

Example(s):
``*color=red,yellow,orange What a beautiful day *``

Returns:
Sets "What" to red. Sets "a" to yellow. Sets "beautiful" to orange. Sets "day" to red.

\*columns \*
----------------
Description: Divides content into columns. Useful when splitting page into several sections.

Input: String

Arguments: Number (Optional: into how many columns to split i.e. 2 makes the column half the size, 3 makes column 1/3 size, etc..[default: 1]),
Number[1] (Optional: By default columns are equivalent in height, with this argument set to 1. Columns will only be the size of their own content[default: table-cell])

Example(s):
``*columns=2 Hello *``

Returns:
Column with half the size with the content of hello.

\*commands \*
----------------
Description: Lists commands currently available and their level (if imported).

Input: String (Input the command that starts with) or empty to display all available commands.

Arguments: Number[level] or String[Name] (Optional: input a number to display only commands in that level or name to display commands from the imported module) x Inifnity

Example(s):
``*commands=2 i*``

Returns:
``*clearinterpreter * >> IMPORTED from interpreter level: 2``
``*deleteinterpreter * >> IMPORTED from interpreter level: 2``
``*downloadcommands * >> IMPORTED from interpreter level: 2``
``*import *``
``*ip *``
``*isp *``
``*italics *``

\*completedate \*
-------------------
Description: Outputs complete date in pretty format.

Input: NONE

Arguments: NONE

Example(s):
``*completedate *``

Returns:
``Friday, December 18, 2015``

\*condition \*
----------------
Description: Evaluates the arguments and if they are true, return the Input.

Input: String (Input that will be returned if condition evaluates to true)

Arguments: boolean or value (Optional/Required: The condition that satisfy the statement [default: true]) x Infinity

.. note: if you use more arguments they act as if you use an or statement.

Example(s):
``*condition=5>3 hello *``
``*condition=5<3 hello *``
``*condition=5<3,5>3 Yes *``
Returns:
``Hello``
`` ``
``Yes``

\*convertwhitespace \*
-----------------------
Alias: cw

Description: Replaces spaces with special characters. Useful for using in arguments that require space (since you cannot use spaces in arguments)

Input: String to have spaces replaced with

Arguments: NONE

Example(s):
``*convertwhitespace Hello World *``

Returns:
``Hello World``

.. note: "Hello World" Now contains a special character instead of space which allows you to use it in arguments or when you need to use long sentence.

\*conways \*
-----------------------

Description: Returns a Conway's constant

Input: NONE

Arguments: NONE

Example(s):
``*conways *``

Returns:
``1.30357``

\*conways \*
-----------------------

Description: Returns a Conway's constant

Input: NONE

Arguments: NONE

Example(s):
``*conways *``

Returns:
``1.30357``

\*cos \*
----------------
Alias: cosine

Description: Takes in the a decimal, and finds the cosine.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*cos 0 *``

Returns:
``1``

\*cosecant \*
----------------
Description: Takes in the a decimal, and finds the cosecant.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*cosecant 1 *``

Returns:
``1.1883951057781212``


\*cosh \*
----------------
Description: Takes in the a decimal, and finds the hyperbolic cosine.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*cosh 1 *``

Returns:
``1.5430806348152437``

\*cosine \*
----------------
Alias: cos

Description: Takes in the a decimal, and finds the cosine.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*cosine 0 *``

Returns:
``1``

\*cot \*
----------------
Alias: cotangent

Description: Takes in the a decimal, and finds the cotangent.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*cot 1 *``

Returns:
``0.6420926159343306``

\*cotangent \*
----------------
Alias: cot

Description: Takes in the a decimal, and finds the cotangent.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*cotangent 1 *``

Returns:
``0.6420926159343306``

\*coth \*
----------------

Description: Takes in the a decimal, and finds the hyperbolic cotangent.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*coth 1 *``

Returns:
``1.3130352854993315``

\*count \*
----------------

Description: Counts the number of elements seperated by either commas or if not available then spaces.

Input: String x Infinity

Arguments: NONE

Example(s):
``*count hockey football soccer tennis *``
``*count red, white, blue *``
``*count hello world, goodbye world, no man *``

Returns:
``4``
``3``
``3``

\*countryfromip \*
--------------------

Description: Gets the country from the ip address.

Input: String[ip]

Arguments: NONE

Example(s):
``countryfromip 8.8.8.8``

Returns:
``United States``
	
\*crossout \*
----------------

Description: Crosses out the text

Input: String

Arguments: NONE

Example(s):
``*crossout I made a mistake *``

Returns:
This will crossout "I made a mistake"


\*csch \*
----------------

Description: Takes in the a decimal, and finds the hyperbolic cosecant.

Input: A decimal

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*csch 1 *``

Returns:
``0.8509181282393216``

\*cw \*
-----------------------
Alias: convertwhitespace

Description: Replaces spaces with special characters. Useful for using in arguments that require space (since you cannot use spaces in arguments)

Input: String to have spaces replaced with

Arguments: NONE

Example(s):
``*cw Hello World *``

Returns:
``Hello World``

.. note: "Hello World" Now contains a special character instead of space which allows you to use it in arguments or when you need to use long sentence.


\*date \*
----------------

Description: Outputs date in a standard output.

Input: NONE

Arguments: NONE

Example(s):
``*date *``

Returns:
``12/19/2015``

\*decimalcount \*
-------------------

Description: Counts the number of decimal points.

Input: Decimal/Number

Arguments: NONE

Example(s):
``*decimalcount 20.3213231 *``

Returns:
``7``

\*deport \*
----------------

Description: Deports a module and removes its commands.

Input: String(Module Name)

Arguments: NONE

Example(s):
``*deport graph *``

Returns:
Tries to deport graph. If the module is already deported or was never the command throws an error.

\*divide \* or \*/ \*
------------------------

Description: Takes the first Number and tries to divide everything after it...

Input: Number x Infinity

Arguments: NONE

Example(s):
``*divide 100 2 5 *``
``*/ 55 2 5 *``

Returns:
``10``
``5.5``

\*download \*
----------------

Description: Downloads the module from URL and saves it to local drive.

Input: String(URL)

Arguments: NONE

Example(s):
``*download http://repo.juliar.org/encryption.juliar *``

Returns:
Tries to download encryption module from juliar repo.

\*dynamicget \*
----------------

Description: Dynamically gets the value. If value changes..the content also changes. Useful for displaying content that changes...
Use it with \*dynamicset \*

Input: object[name]

Arguments: NONE

Example(s):
``*dynamicset=x 2 *``
``*dynamicget x *``
``*dynamicget=x 5 *``

Returns:
``5``
``5``
``5``

\*dynamicinput \*
------------------

Description: When user types in this input field. It changes the input of "dynamic" fields.

Input: String (default value for input field)

Arguments: Object (which dynamic field to modify)

Example(s):
``*dynamicget x *``
``*dynamicset=x 2 *``
``*dynamicinput=x 33 *``
User changes the field to Hello.

Returns:
``Hello``
``Hello``
``Hello``

\*dynamicset \*
----------------

Description: Dynamically changes the content of objects. Also returns new dynamic field(same as dynamicget). Use \*hide \* to not return the object but still modify the value of all other dynamic fields.

Input: String(Sets the content of dynamic field to this)

Arguments: Object (with which names should we modify the dynamic fields)

Example(s):
``*dynamicset=x 33*``

Returns:
``33``

\*dynamicfetch \*
------------------

Description: Fetches the URL in the background, and once the content is fully received the text changes to that content.

Input: String(URL)

Arguments: NONE

Example(s):
``*dynamicfetch http://repo.juliar.org/fetchedcotnent *``

Returns:
Content that was fetched gets put here once it's received.

\*e \*
----------------

Description: Returns the value of e. If input is specified e gets raised to that power.

Input: e to which power

Arguments: NONE

Example(s):
``*e *``
``*e 2 *``

Returns:
``2.718281828459045``
``7.3890560989306495``

\*epsilon \*
----------------

Description: Gets the epsilon "medium" value. Currently available epsilon values: "Vacuum", "Air","Ethanol", and "Water".

Input: Medium Type

Arguments: NONE

Example(s):
``*epsilon Air*``

Returns:
``1.00058986``

\*equalto \*
----------------

Description: Checks to see if all input (seperated by space) are equal to each other.

Input: comparable objects seperated by space x Infinite

Arguments: NONE

Example(s):
``*equalto 33 33*``
``*equalto 2 33*``

Returns:
``true``
``false``

\*error \*
----------------

Description: Alerts the user with the input

Input: String (input that should alert the user)

Arguments: NONE

Example(s):
``*alert Stop This*``

Returns:
``Error Invoked: Stop This``
Displays an Alert to the user "Stop This"

\*evaluate \*
----------------

Description: A low level command that can evaluate almost any script.

Input: String (to be evaluated)

Arguments: NONE

Example(s):
``*evaluate 5>3*``
``*evaluate 5+5*``

Returns:
``true``
``10``

\*evaluate \*
----------------

Description: A low level command that can evaluate almost any script.

Input: String (to be evaluated)

Arguments: NONE

Example(s):
``*evaluate 5>3*``
``*evaluate 5+5*``

Returns:
``true``
``10``

\*factorial \*
----------------

Description: This value easily finds factorial of the number using tail-recursion.

Input: Number (Number of factorial)

Arguments: NONE

Example(s):
``*factorial 10*``
``*factorial 5*``

Returns:
``3628800``
``120``

\*favicon \*
----------------

Description: Changes the favicon of the browser(Browser's small image located at the tab) to the URL that's specified.

Input: URL (the url of the image to use for browser's tab image)

Arguments: NONE

Example(s):
``*favicon juliar-logo.png*``

Returns:
``Favicon changed to juliar-logo.png``
Changes favicon (image on the tab of the website)

\*fetch \*
----------------

Description: Fetches content from the URL specified.

Input: URL (the url to fetch content from)

Arguments: NONE

Example(s):
``*fetch http://juliar.org/content*``

Returns:
Fetched content from the URL.

\*flash \*
----------------
Alias: pdf, java

Description: Creates a flash object in browser video.

Input: URL (the url of where to get the flash object)

Arguments: Number (Optional: Width of the Flash Object[default:420]), Number (Optional: Height of the Flash Object[default:315])

Example(s):
``*flash http://somegamewebsite.com/game.swf*``

Returns:
Shows the game from the "http://somegamewebsite.com/game.swf" url.

\*float \*
----------------
Description: Floats(display) the element either left or right side of the screen.

Input: String (Content to be floated)

Arguments: "left" or "right" (Optional: Pass in whether you want the elements to be floated left or right [default: "right"])

Example(s):
``*float hello*``

Returns:
"hello" will be displayed on the right side of the page.


\*font \*
----------------

Description: Gets a very nice font from google fonts api.

Input: String (the content that will use the font)

Arguments: String (Required: URL of Google Font to use for the content )

.. note: If Google Font Family Contains Spaces use Camel cases... i.e. "Source Sans Pro" should be passed in as "SourceSansPro"

Example(s):
``*font=SourceSansPro Hello World*``

Returns:
Displays Hello World in Google Font's Source Sans Pro Font.


\*footer \*
----------------

Description: Adds footer with the Input being as content.

Input: Content that will use footer.

Arguments: NONE

Example(s):
``*footer copyright 2015*``

Returns:
This will display the "copyright 2015" message as a footer. The footer is usually placed at the very end of the code.

\*footer \*
----------------

Description: Adds footer with the Input being as content.

Input: Content that will use footer.

Arguments: NONE

Example(s):
``*footer copyright 2015*``

Returns:
This will display the "copyright 2015" message as a footer. The footer is usually placed at the very end of the code.

\*gcd \*
----------------

Description: Finds greatest common denominator of the numbers.

Input: Numbers (Required: at least 2 numbers that you need to find gcd of )

Arguments: NONE

Example(s):
``*gcd 55 22*``

Returns:
``11``

\*get \*
----------------

Description: Gets the content of the object stored with the name of the Input and returns it.

Input: String (Name of the object to get)

Arguments: NONE

Example(s):
``*set=x 2 *``
``*get x*``

Returns:
``2``

\*gethistory \*
----------------

Description: Gets and goes to the URL stored in the history object.

Input: String (Name of the history object that is stored)

Arguments: NONE

Example(s):
``*gethistory x*``

Returns:
Opens a URL with the named history object.

\*getsocket \*
----------------

Description: Gets the content from the socket with Input name.

Input: String (Name of the socket to get contents from)

Arguments: NONE

Example(s):
``*getsocket x*``

Returns:
Gets the content from socket x.

\*globalbackground \*
----------------------

Description: Sets the background of the whole window. Similar to \*background \* command except this is applied to the whole window.

Input: Content

Arguments: String[Color Name] or Hex Value or rgb() or URL[for images] (Optional: Background Color/Image[default: red]), String (Optional: sets second color for gradient[default:none])

Example(s):
``*backgroundglobal yellow blue *``

Returns:
Sets background of the whole window to a mix of yellow/blue.

\*goldenration \*
---------------------
Description: Returns Golden Ratio.

Input: NONE

Arguments: NONE

Example(s):
``*goldenratio *``

Returns:
``1.618033988749895``

\*gravitational \*
---------------------
Description: Returns Gravitational Constant.

Input: NONE

Arguments: NONE

Example(s):
``*gravitational *``

Returns:
``6.674e-11``

\*gravity \*
----------------------

Description: Returns the Gravity constant in (m/s2) at the surface of the plants or moon.

Input: Planet/Moon you want gravity of.

Arguments: NONE.

Example(s):
``*gravity earth *``

Returns:
``9.798``

\*greaterthan \*
------------------

Description: Checks to see if the first number is greater than the rest of the numbers.

Input: comparable objects seperated by space x Infinite

Arguments: NONE

Example(s):
``*greaterthan 33 22 32*``

Returns:
``true``

\*greaterthanorequalto \*
--------------------------

Description: Checks to see if the first number is greater than or equal to the rest of the numbers.

Input: comparable objects seperated by space x Infinite

Arguments: NONE

Example(s):
``*equalto 33 33 22*``

Returns:
``true``

\*grow \*
----------------

Description: This command makes text get larger and larger.

Input: Text that you want to grow.

Arguments: NONE

Example(s):
``*grow welcome*``

Returns:
The "welcome" will get bigger and bigger.


\*header \*
----------------

Description: Adds header with the Input being as content.

Input: Content that will use header.

Arguments: NONE

Example(s):
``*header welcome*``

Returns:
This will display the "welcome" message as a header. The header is usually placed at the very beggining of the code.


\*help \*
----------------

Description: Help + Command Name to display help of the command. If help is not available it will try to fetch help from Juliar REPO.
If it's not available, it will fail.

Input: Command that you need help with

Arguments: NONE

Example(s):
``*help *``

Returns:
``Type *help  'command name'* to see help for the command``

\*hide \*
----------------

Description: This command hides the text and everything. It's useful for hiding the output of commands such as \*dynamicset \* or \*alert \*.

Input: NONE

Arguments: NONE

Example(s):
``*hide Hello World*``

Returns:
`` ``

\*highlight \*
----------------

Description: Highlights  each letter using the color specified. If you want to color whole background, please use backgroundcolor command.

Input: Text that will be colored

Arguments: Colors or Color Hex Value (Optional: Color that you want letters to have [defaut:orange]) x Infinity

Example(s):
``*highlight=red, orange Hello World*``

Returns:
Each letter will alternate between colors of red and orange.

\*history \*
----------------

Description: Gets the history length and outputs the number of history elements you have.

Input: NONE

Arguments: NONE

Example(s):
``*history*``

Returns:
``4``

\*import \*
----------------

Description: Imports Juliar Module (.juliar), juliar style sheet (.jss), or juliar code (.j). 
If extension is not provided, Juliar Module is assumed. This command now works locally and on a server.

Input: Module, Stylesheet, or Juliar Code Name.

Arguments: String (Optional: Name you want to call the module[default:null].(Argument is Still IN TESTING. LEAVE IT AS DEFAULT FOR NOW!)

Example(s):
``*import encryption*``

Returns:
This will import encryption module and use its commands.

\*ip \*
----------------

Description: Gets the ip address from URL

Input: URL (url of address that you want to find the ip of)

Arguments: NONE

Example(s):
``*ip http://google.com*``

Returns:
This will display the  "8.8.8.8" as one of the IPs.

\*isp \*
----------------

Description: Input IP, to display the internet service provider.

Input: String[IP] (you want to use to find ISP)

Arguments: NONE

Example(s):
``*isp 8.8.8.8*``

Returns:
This will display Google as Google is its own service provider.

\*italics \*
----------------

Description: Makes the text be in italics

Input: String (text that will be in italics)

Arguments: NONE

Example(s):
``*italics I am skewed*``

Returns:
This will display message "I am skewed" in italics

\*java \*
----------------
Alias: pdf, flash

Description: Creates a JAVA object in browser video.

Input: URL (the url of where to get the JAVA object)

Arguments: Number (Optional: Width of the JAVA Object[default:420]), Number (Optional: Height of the JAVA Object[default:315])

Example(s):
``*java http://somegamewebsite.com/game.java*``

Returns:
Shows the game from the "http://somegamewebsite.com/game.java" url.

\*javascript \*
----------------

Description: Executes pure javascript code.

Input: String (javascript code to be executed)

Arguments: NONE

Example(s):
``*javascript alert("hello");*``

Returns:
This will execute the javascript statement alerting the user with "Hello"

\*khinchins \*
---------------------
Description: Returns Khinchin's constant.

Input: NONE

Arguments: NONE

Example(s):
``*khinchins *``

Returns:
``2.6854520010``

\*killframes \*
---------------------
Description: Some sites may try to use an iframe to load your website. This command prevents people from loading the content of this page from any other website.

Input: NONE

Arguments: NONE

Example(s):
``*killframes *``

Returns:
Makes sure that the code is ran in the real URL.

\*kinkelin \*
---------------------
Description: Returns Glaisher-Kinkelin Constant.

Input: NONE

Arguments: NONE

Example(s):
``*kinkelin *``

Returns:
``1.2824271291``

\*largenumber \*
---------------------
Description: Returns Max-value before the number starts with 0 again.

Input: NONE

Arguments: NONE

Example(s):
``*largenumber *``

Returns:
OS dependent, but usually ``1.7976931348623157e+308``

\*larger \*
---------------------
Description: Makes text a bit larger.

Input: Text that you wish to be enlarged

Arguments: NONE

Example(s):
``*rw H *larger e * llo *``

Returns:
``H`` e being larger and then ``llo``.

\*lcm \*
---------------------
Description: Finds least common multiple of the numbers.

Input: Numbers (Required: at least 2 numbers that you need to find gcd of )

Arguments: NONE

Example(s):
``*lcm 5 2*``

Returns:
``10``

\*left \*
---------------------
Description: Aligns the content to the left.

Input: String content that should be aligned to the left

Arguments: NONE

Example(s):
``*left hello world*``

Returns:
``hello world``

\*lessthan \*
---------------------
Description: Checks to see if the first number is less than the rest of the numbers.

Input: comparable objects seperated by space x Infinite

Arguments: NONE

Example(s):
``*lessthan 11 33 22 32*``

Returns:
``true``

\*lessthanorequalto \*
-----------------------
Description: Checks to see if the first number is less than or equal to the rest of the numbers.

Input: comparable objects seperated by space x Infinite

Arguments: NONE

Example(s):
``*lessthanorequalto 11 11 33 22 32*``

Returns:
``true``

\*link \*
---------------------
Description: Creates a link that a user can click and it will be redirected to

Input: comparable objects seperated by space x Infinite

Arguments: Number (Optional: If a false statement, opens the URL in a new page, otherwise opens the URL in the current page[default:new page])

Example(s):
``*link http://juliar.org*``

Returns:
Creates a link that goes to http://juliar.org

\*list \*
---------------------
Description: Creates list content. Similar to \*bullet \* except has a numerical or alphabetical ordering.

Input: Content to be listed

Arguments: String or 1 (Optional: Pick the type of list: "decimal","lowercase","uppercase","roman","uppercaseroman" [default:"decimal"])

Example(s):
``*list sleep *``
``*list eat *``

Returns:
``1. sleep``
``2. eat``

.. note: You can create numbering by using multiple lists via executing same command.

\*locationfromip \*
--------------------
Description: Gets latitute and longitude from the ip specified.

Input: String[ip]

Arguments: NONE

Example(s):
``*locationfromip 8.8.8.8 *``

Returns:
This is one of google's ips and it outputs latitute and longitude from the ip specified.

\*log \*
----------------
Description: Take the logarithm of the number.

Input: String[ip]

Arguments: Number(Optional: take lagorithm with a different base [default: natural logarithm])

Example(s):
``*log=2 8 *``

Returns:
``3``

\*loop \*
----------------
Alias: repeat

Description: Loops the content X number of times

Input: String[ip]

Arguments: Number(Optional: Number of times to loop the content [default: 2])

Example(s):
``*loop=5 hello *``

Returns:
``hello hello hello hello hello``

\*lowercase \*
----------------
Description: Make the content lowercase

Input: String (content that you wish to be lowercase)

Arguments: NONE

Example(s):
``*lowercase HELLO world HOW ARE YOU *``

Returns:
``hello world how are you``

\*mail \*
----------------
Description: Creates a link that can be clicked to send an email to person.

Input: The NAME you want the link to be called.

Arguments: String (Optional: The email that will be used i.e. 1234@example.com  [default:Input will be used])

Example(s):
``*mail=johnsmith@example.com HELLO world HOW ARE YOU *``

Returns:
``John Smith`` when clicked it will send email to johnsmith@example.com

\*mascheroni \*
---------------------
Description: Returns Euler–Mascheroni constant (also called Euler's constant)

Input: NONE

Arguments: NONE

Example(s):
``*mascheroni *``

Returns:
``0.57721``

\*maximum \*
----------------
Description: Finds the maximum number

Input: Number (Required: At least one number, seperated by spaces) X Infinity

Arguments: NONE

Example(s):
``*maximum 0 5 2 10 3 7 *``

Returns:
``10``

\*menu \*
----------------
Description: Creates a start and stop of the menu. Inside, you may use \*menuitem \*

Input: \*menuitem \* objects

Arguments: String (Optional: Name of the menu, useful for creating dynamic content)

Example(s):
``*menu *menuitem=http://juliar.org Home **``

Returns:
Creates a menu with a HOME button that goes to http://juliar.org

\*menuitem \*
----------------
Description: Requires \*menu \* wrapping it. Creates menuitems to be used in menu.

Input: Name of the link.

Arguments: URL (Optional/Required: URL to what you want the content to be redirected to[default:#/NONE]),  Number(Optional: Type of Redirection, 0=Current Window,1=New Window,2=Save the content and apply to dynamic content [default:0/Current Window]), URL (Optional: URL to picture to use in the background [default:none])

Example(s):
``*menu *menuitem=http://juliar.org Home **``

Returns:
Creates a menu with a HOME button that goes to http://juliar.org

\*middle \*
----------------
Description: Puts element in the middle. Compare with \*center \* which mostly sets only text in the middle.

Input: Content of Element or Text to be put in the middle

Arguments: NONE

Example(s):
``*middle *section=2 box **``

Returns:
``box`` with section being in the middle of the content.



\*minimum \*
----------------
Description: Finds the minimum number

Input: Number (Required: At least one number, seperated by spaces) X Infinity

Arguments: NONE

Example(s):
``*minimum 0 5 2 10 3 7 *``

Returns:
``0``

\*modules \*
----------------
Description: Returns all currently imported modules.

Input: NONE

Arguments: NONE

Example(s):
``*modules *``

Returns:
``main,graph,interpreter,encryption``

\*multiply \* or \*x \*
---------------------
Description:Takes in numbers and multiplies them all together.

Input: Number or Numbers (Required: at least 1, Seperated by spaces) x Infinity

Arguments: NONE

Example(s):
``*multiply 3 2 *``
``*x 5 2 6 *``

Returns:
``6``
``60``

\*music \*
----------------
Description: Takes in URL of the music file (.mp3 or .ogg) and plays it.

Input: Number (Required: At least one number, seperated by spaces) X Infinity

Arguments: NONE

Example(s):
``*music stairwaytoheaven.mp3 *``

Returns:
Plays Stairway to Heaven by Led Zeppelin.

\*newline \*
----------------
Description: Creates a new line. Useful for putting content on new line

Input: Number of new lines to create

Arguments: NONE

Example(s):
``*newline 5 *``

Returns:
Creates 5 newlines.

\*newsbanner \*
----------------
Description: Creates a news banner that scrolls from right to left (Like a banner in news channel)

Input: String (The content of newsbanner)

Arguments: Number (Optional: How fast do you want the banner to scroll in seconds [default:5])

Example(s):
``*newsbanner 10 people survived *``

Returns:
``10 people survived`` being scrolled from right to left at 5 seconds.

\*newspaper \*
----------------
Description: Seperates content into columns. Compare with \*columns \* where you have to create element for each column.

Input: String (Content of object)

Arguments: Number (Optional: Number of columns [default:2])

Example(s):
``*newspaper=2 Hello World *``

Returns:
Creates Hello World in two seperate columns.

\*newwindow \*
----------------
Description: Opens up a new window.

Input: The url of the window you wish to open [default: http://juliar.org]

Arguments: NONE

Example(s):
``*newwindow http://juliar.org *``

Returns:
Opens http://juliar.org in a new window.

\*not \*
-------------------
Description: Takes in values, and checks if all values are false, if one of the values is true, it returns false.

Input: Booleans or Strings or Numbers

Arguments: NONE

Example(s):
``*not 0 0 false *``
``*not 0 1 false *``

Returns:
``true``
``false``

\*notice \*
----------------
Description: Creates a notice banner.

Input: Text what you want the user to be notified of.

Arguments: Color or Hex Value (Optional: Background color of the content[default:#428bca/steelblue]), Color or Hex Value (Optional: Text color of the content[default:white]),
Number w/ type (Optional: Font Size[default:16px]), Number (Optional: padding of the content [default:5px])

Example(s):
``*notice please login *``

Returns:
Creates a notice with text please login.

\*or \*
-------------------
Description: Takes in values, if one of the values evaluate to true returns true, if one of the values evaluate to false returns false.

Input: Booleans or Strings or Numbers

Arguments: NONE

Example(s):
``*or true 1 55 *``
``*or 0 0 55 *``
``*or false 0 *``

Returns:
``true``
``true``
``false``

\*outline \*
----------------
Description: Creates content with an outline of the text.

Input: Text what you want to have the outline

Arguments: Color or Hex Value (Optional: Color of the outline[default:orange])

Example(s):
``*outline cool *``

Returns:
Creates text cool with an outline.

\*overline \*
----------------
Description: Creates a line over the text.

Input: Text what you want the line to be over.

Arguments: NONE

Example(s):
``*overline cool *``

Returns:
Creates text cool with a line over it.

\*padding \*
----------------
Description: Creates padding/space between the content

Input: Content of what you want the padding to be applied to.

Arguments: Number (Optional: How much space should we add between objects[default:5px]), Pad Type (Optional: What type of space should we apply: "all"=apply padding to all sides
"top"=apply padding to top only, "bottom"=apply padding to bottom only, "left"=apply padding to left only,"right"=apply padding to right only, "sides"=apply padding to left and right
only,"vertical"=apply padding to top and bototm only[defualt:all])

Example(s):
``*padding=30px,left cool *``

Returns:
Creates text cool with a 30px of spacing between last element.

\*pagetitle \*
----------------
Description: Changes the title of the page/webpage.

Input: Text what you want the page to be called.

Arguments: NONE

Example(s):
``*pagetitle Red*``

Returns:
``Pagetitle Changed to Red`` and Changes the Page Title to Red.

\*pdf \*
----------------
Alias: flash, java

Description: Creates a PDF object in browser.

Input: URL (the url of where to get the PDF object)

Arguments: Number (Optional: Width of the PDF Object[default:420]), Number (Optional: Height of the PDF Object[default:315])

Example(s):
``*pdf http://somegamewebsite.com/some.pdf*``

Returns:
Opens up pdf from the "http://somegamewebsite.com/some.pdf" url.

\*pi \*
---------------------
Description: Returns PI constant

Input: NONE

Arguments: NONE

Example(s):
``*pi *``

Returns:
``3.1415926535897932384626433832795028841971693993751058209749445923078164062862089``

\*pick \*
----------------

Description: Creates a PDF object in browser.

Input: String (Optional: elements to pick from seperated by space) x Infinity

Arguments: Number (Optional: Number of elements to pick from[default:1]), Boolean(Optional: 1=Elements can be picked again from already picked elements, 0=elements can only be picked once [default:1/Elements can be picked again])

Example(s):
``*pick Hello Tree World*``
``*pick=2,0 Hello Tree World*``
``*pick=4,0 Hello Tree World*``
Returns:
``Tree``
``Hello World``
Error: `Not enough elements to pick from`

\*picture \*
----------------

Description: Creates a picture by taking in image and optional width and height arguments and centers it.
Compare with \*picture \*

Input: Image Source

Arguments: Size or "%" or Number  (Optional: Width of Picture[default: 100%]), Size or "%" or Number (Optional: Height of Picture[default: auto])

Example(s):
``*picture *``

Returns:
Returns a picture

.. note: width cannot be greater than 100%.

\*power \* or \*^ \*
---------------------

Description: Takes the first Number and powers everything after it...

Input: Number x Infinity (each number seperated by space)

Arguments: NONE

Example(s):
``*power 100 2 5 *``
``*^ 5 2 *``

Returns:
``100000000000000000000``
``25``

\*pythagoras \*
---------------------
Description: Returns Pythagora's constant

Input: NONE

Arguments: NONE

Example(s):
``*pythagoras *``

Returns:
``1.4142135623730951``

\*rainbow \*
---------------------
Description: Colors each letter using the color specified. If you want to color whole background, please use backgroundcolor command. Compare with \*highlight \*

Input: Text that will be colored

Arguments: Colors or Color Hex Value (Optional: Color that you want letters to have [defaut:orange]) x Infinity

Example(s):
``*rainbow=red, orange Hello World*``

Returns:
Each letter will alternate between colors of red and orange.

\*randomize \*
---------------------
Description: Randomizes elements seperated by space and outputs them.

Input: String (Required: Elements to be randomized) x Infinity 

Arguments: NONE

Example(s):
``*randomize hello world how are you today *``

Returns:
``are today how world you hello``

\*randomnumber \*
---------------------
Description: Returns Pythagora's constant

Input: NONE

Arguments: Number (Optional: Number of numbers you want to have[default:1]), Number(Optional: Highest value of the random number[default:100])

Example(s):
``*randomnumber *``

Returns:
``11``

\*reflect \*
---------------------
Description: Reflects the content over X or Y axis.

Input: NONE

Arguments: "X" or "Y" (Optional: Reflect over which axis, "X" or "Y"[default:"X"])

Example(s):
``*reflect hello *``

Returns:
Reflected hello over x axis.

\*regionfromip \*
---------------------
Description: Gets region from the ip specified.

Input: String[ip]

Arguments: NONE

Example(s):
``*regionfromip 8.8.8.8 *``

Returns:
This is one of google's ips and it outputs region from the ip specified.

\*remainder \* or \*% \*
-------------------------
Description:  Takes the first Number and tries to divide everything after it and outputs remainder.

Input: Numbers (Required: 2[default:N/A])

Arguments: NONE

Example(s):
``*% 32 3 *``

Returns:
``2``

\*removewhitespace \*
---------------------
Alias: rw

Description:  Removes whitespace.

Input: String (Required: from what content do you want whitespace to be removed)

Arguments: NONE

Example(s):
``*removewhitespace Hello World U *``

Returns:
``HelloWorldU``

\*repeat \*
----------------
Alias: loop

Description: Loops the content X number of times

Input: String[ip]

Arguments: Number(Optional: Number of times to loop the content [default: 2])

Example(s):
``*repeat=5 hello *``

Returns:
``hello hello hello hello hello``

\*replacehistory \*
--------------------

Description: Replaces history

Input: URL (of what you want history to be)

Arguments: Object (Optional: History of the object name[default: null])

Example(s):
``*replacehistory=5 http://juliar.org *``

Returns:
Replaces #5 history and sets it to http://juliar.org

\*repo \*
----------------

Description: Sets the repo to new url (default: http://repo.juliar.org)

Input: URL (of what you want repo to be)

Arguments: NONE

Example(s):
``*repo http://repo.someothersite.org *``

Returns:
Sets repo to http://repo.someothersite.org

\*restore \*
----------------

Description: Restores content that you used to store with \*store \*. 

Input: URL (of what you want history to be)

Arguments: NONE

Example(s):
``*restore x *``

Returns:
``I was restored ``

.. note: using store and restore commands make it so that even if you leave the page the content will remain.

\*reverse \*
----------------

Description: Reverses the whole string

Input: String that you want to have reversed

Arguments: NONE

Example(s):
``*reverse Hello *``

Returns:
``olleH ``

\*right \*
---------------------
Description: Aligns the content to the left.

Input: String content that should be aligned to the left

Arguments: NONE

Example(s):
``*right hello world*``

Returns:
``                 hello world``

\*root \*
---------------------
Description: Aligns the content to the left.

Input: Number (from what number to take the root from)

Arguments: Number (Optional: What type of root to take [default:2])

Example(s):
``*root=3 -27*``

Returns:
``-3``

\*rotate \*
---------------------
Description: Rotates the content by some number of degrees.

Input: Number (Optional: By how many degrees to rotate [default:350]), Number (Optional: Positon of where the content will be located in terms of Y axis 
(negative means relative to bottom, positive means relative to top) [default:inherited]),
Number (Optional: Positon of where the content will be located in terms of X axis 
(negative means relative to left, positive means relative to right) [default:inherited])

Arguments: NONE

Example(s):
``*rotate hello world*``

Returns:
rotated hello world

\*rw \*
---------------------
Alias: removewhitespace

Description:  Removes whitespace.

Input: String (Required: from what content do you want whitespace to be removed)

Arguments: NONE

Example(s):
``*rw Hello World U *``

Returns:
``HelloWorldU``

\*secant \*
----------------
Description: Takes in the a decimal, and finds the secant function.

Input: Number

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*secant 0*``

Returns:
``1``

\*sech \*
----------------
Description: Takes in the a decimal, and finds the hyperbolic secant function.

Input: Number

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*sech .5*``

Returns:
``0.886818883970074``

\*section \*
----------------
Description: Creates a section for the content.

Input: String (content of the section)

Arguments: pixels or size (Optional: Width of the section[default:auto]), pixels or size (Optional: Height of the section[default:auto]), size (Optional: Margin in X[default:0]),
size (Optional: Margin in Y[default:auto]), color (Optional: Background Color of the content[default:transparent])

Example(s):
``*section 5 2 *``

Returns:
``5 2`` with section formatting.

\*set \*
----------------
Description: Used with *get *. Used to set parameter that you don't want to be dynamically changed.

Input: Number

Arguments: Object (Optional/Required: variable to store the content in)

Example(s):
``*set=x 5*``
``*get x *

Returns:
``5``

\*sethistory \*
----------------

Description: Replaces history

Input: URL (of what you want history to be)

Arguments: Object (Optional: what to call the new history[default: null])

Example(s):
``*sethistory=5 http://juliar.org *``

Returns:
Sets history to http://juliar.org

\*setsocket \*
----------------
Description: Sends content to the socket.

Input: Content to send through the socket.

Arguments: ``Object [Required/Optional: Socket to use[default:null])

Example(s):
``*setsocket=x I am sending using a socket*``

Returns:
``Sends content through socket.``

\*shrink \*
----------------

Description: This command makes text get smaller and smaller.

Input: Text that you want to shrink.

Arguments: NONE

Example(s):
``*shrink welcome*``

Returns:
The "welcome" will get smaller and smaller.

\*sin \*
----------------
Alias: sine

Description: Takes in the a decimal, and finds the sine.

Input: Number

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*sin 0*``

Returns:
``0``

\*sine \*
----------------
Alias: sin

Description: Takes in the a decimal, and finds the sine.

Input: Number

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*sine 0*``

Returns:
``0``

\*sinh \*
----------------

Description: Takes in the a decimal, and finds the hyperbolic sine function.

Input: Number

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*sinh *pi**``

Returns:
``11.548739357257748``

\*size \*
----------------

Description: Sets font size of the content.

Input: Content that you want to change size of.

Arguments: px, em, or sizes (Optional: Font size of the content [default:inherit])

Example(s):
``*size=14px Hello``

Returns:
``Hello`` with font size  of 14px.

\*smaller \*
---------------------
Description: Makes text a bit smaller.

Input: Text that you wish to be shrinked.

Arguments: NONE

Example(s):
``*rw H *larger e * llo *``

Returns:
``H`` e being smaller and then ``llo``.

\*smallnumber \*
---------------------
Description: Returns Smallest-value before the number starts with 0 again.

Input: NONE

Arguments: NONE

Example(s):
``*smallnumber *``

\*socket \*
---------------------
Description: Establishes a socket between you and the server

Input: URL (of the server that you want to connect with)

Arguments: Object (Optional: where to store the socket [default:null])

Example(s):
``*socket=x juliar.socket *``

\*spoiler \*
---------------------
Description: Creates content as a spoiler. As a user hovers over the text, the text becomes visible.

Input: Content that you want to act as a spoiler.

Arguments: Color (Optional: color of hidden lines [default:black],Color (Optional: background color when user hovers over [default:black]), Color (Optional: color of text when user hovers[default:white])

Example(s):
``*spoiler this is a game spoiler *``

Returns:
``this is a game spoiler``

\*statehistory \*
----------------

Description: States the current history

Input: NONE

Arguments: NONE

Example(s):
``*statehistory *``

Returns:
states the history

\*sticky \*
----------------

Description: The content sticks to the page. It does not change!

Input: Content that you want to be sticky.

Arguments: Size(position of the sticky in Y coordinate; if negative its relative to the bottom, if positive it's relative to the top[default:initial]), 
Size (position of the sticky in X coordinate; if negative its relative to the left, if positive it's relative to the right[default: initial])

Example(s):
``*sticky note*``

Returns:
``note`` that sticks to the screen as user scrolls

\*store \*
----------------

Description: stores content that you can later use to restore with \*restore \*. The content stored remains even if user leaves the page.

Input: Content what you want to store.

Arguments: Object (Optional/Required: To which object do you want content to be stored [default:null])

Example(s):
``*store=x I was stored in x*``

Returns:
``I was stored in x``

\*subscript \*
----------------

Description: Makes the content act like subscript

Input: Content what you want to subscript

Arguments: NONE

Example(s):
`` x*subscript 2*``

Returns:
``x2``

\*subtitle \*
---------------------
Description: Creates a subtitle.

Input: String (The subtitle)

Arguments: NONE

Example(s):
``*subtitle Right *``

Returns:
``Right`` in subtitle format.

\*subtract \* or \*- \*
------------------------

Description: Takes the first Number and tries to subtract everything after it...

Input: Number x Infinity

Arguments: NONE

Example(s):
``*subtract 100 2 5 *``
``*- 55 2 5 *``

Returns:
``93``
``48``

\*superscript \*
----------------

Description: Makes the content act like superscript

Input: Content what you want to superscript

Arguments: NONE

Example(s):
`` x*superscript 2*``

Returns:
``x2``

\*symbol \*
----------------

Description: Outputs a symbol that's commonly used

Input: Currently Available Symbols: (sigma,delta,integral,plusminus,leftright,up,down,left,right,doubleleftright,doubleup,doubledown,doubleleft,doubleright)

Arguments: NONE

Example(s):
``*symbol right *``

Returns:
``->``

\*tan \*
----------------
Alias: tangent

Description: Takes in the a decimal, and finds the tangent function.

Input: Number

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*tan .5*``

Returns:
``0.5463024898437905``

\*tangent \*
----------------
Alias: tan

Description: Takes in the a decimal, and finds the tangent function.

Input: Number

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*tangent .5*``

Returns:
``0.5463024898437905``

\*tanh \*
----------------
Description: Takes in the a decimal, and finds the hyperbolic tangent function.

Input: Number

Arguments: ``degrees`` or ``360`` or True value (Optional: whether to use degrees [default uses radians])

Example(s):
``*tanh .5*``

Returns:
``0.46211715726000974``

\*temperature \*
---------------------
Description: Converts temperature in Kelvin, Farenheit, and Celcius.

Input: NONE

Arguments: Unit (Required: Temperature to convert from (C,K, or F) [default: K]), Unit (Required: Temperature to convert to (C,K, or F) [default:C])

Example(s):
``*temperature=C,K 32 *``

Returns:
``305.15``

\*threed \*
---------------------
Description: Makes the content 3D that can be used with red and cyan glasses.

Input: Content that should be made 3D.

Arguments: Size (Optional: 3D Seperation [default:0.06em])

Example(s):
``*threed hello *``

Returns:
Creates text that can be viewed in 3D with red and cyan glasses.

\*time \*
---------------------
Description: Displays current time.

Input: NONE

Arguments: NONE

Example(s):
``*time *``

Returns:
``11:40:49``

\*timezone \*
---------------------
Description: Displays the timezone that you are in GMT format.

Input: NONE

Arguments: NONE

Example(s):
``*timezone *``

Returns:
``GMT-5``

\*title \*
---------------------
Description: Creates a title.

Input: String (The title name)

Arguments: NONE

Example(s):
``*title Oliver Twist *``

Returns:
``Oliver Twist`` in title format.


\*toDegrees \*
---------------------
Description: Converts Radians to Degrees

Input: NONE

Arguments: NONE

Example(s):
``*toDegrees *pi **``

Returns:
``180``

\*toRadians \*
---------------------
Description: Converts Degrees to Radians

Input: NONE

Arguments: NONE

Example(s):
``*toRadians 90 *``

Returns:
``1.5707963267948966``

\*trash \*
---------------------
Description: Outputs whatever is in trash. If last object that required a name didn't have a name, it goes here.

Input: NONE

Arguments: NONE

Example(s):
``*trash *``

Returns:
``cookie``

\*underline \*
----------------
Description: Creates a line under the text.

Input: Text what you want the line to be under.

Arguments: NONE

Example(s):
``*underline cool *``

Returns:
Creates text cool with a line under it.

\*update \*
----------------
Description: Shows the modules that need updating.

Input: NONE

Arguments: NONE

Example(s):
``*update *``

Returns:
``Modules *encryption * need updating. Click here to update.``

\*uppercase \*
----------------
Description: Make the content uppercase

Input: String (content that you wish to be lowercase)

Arguments: NONE

Example(s):
``*uppercase HELLO world HOW ARE YOU *``

Returns:
``HELLO world HOW ARE YOU``

\*urlparameters \*
--------------------
Description: Outputs url parameters that are used in get command.

Input: NONE

Arguments: NONE

Example(s):
``*urlparameters http://juliar.org?getvars=32, *``

Returns:
``getvars=32``


\*version \*
--------------------
Description: Displays version of the program along with additional information.

Input: NONE

Arguments: NONE

Example(s):
``*version *``

Returns:
``Language *Juliar * version Alpha 4. Running on Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/47.0.2526.106 Safari/537.36``

\*video \*
--------------------
Description: Adds video to the page.

Input: URL of video (Youtube.com, Youtu.be, Twitch, and Vimeo videos get automatically parsed)

Arguments: Number (Optional: Width of the video[default: 420]), Number (Optional: Height of the video[default: 315]), Boolean(Optional: Autolay the video: true=autoplay, false=not autoplay)

Example(s):
``*video https://www.youtube.com/watch?v=irlW_65xkFo *``

Returns:
Video that can be played by the user.

\*visibility \*
--------------------
Description: Sets Visiblity/Opacity/Opaqueness of the element.

Input: NUMBER (in %) (Optional: Set the visibility of the element 0 being invisible, 100 being fully visible[default:40])

Arguments: NONE

Example(s):
``*visiblity hello *``

Returns:
``hello`` with visibility of being 40%.


\*warnonclose \*
--------------------
Description: Adds or removes the option of warning the user before closing the page.

Input: Boolean (If true, warns the user whether they want to continue closing the page, if false, removes that feature)

Arguments: NONE

Example(s):
``*warnonclose *``

Returns:
Whenever user tries to close the page, a popup will be displayed asking whether they want to continue doing so.

\*zipfromip \*
--------------------
Description: Gets zip from the ip specified.

Input: String[ip]

Arguments: NONE

Example(s):
``*zipfromip 8.8.8.8 *``

Returns:
This is one of google's ips and it outputs zip from the ip specified.

\*zonefromip \*
--------------------
Description: Gets zone from the ip specified.

Input: String[ip]

Arguments: NONE

Example(s):
``*zonefromip 8.8.8.8 *``

Returns:
This is one of google's ips and it outputs zone from the ip specified.


